dmitrymosh/pic18-MIRCOE/apps/usb/device/hid_custom/firmware/src/system_config/pic18f47j53_microe/system.h
/********************************************************************
 Software License Agreement:

 The software supplied herewith by Microchip Technology Incorporated
 (the "Company") for its PIC(R) Microcontroller is intended and
 supplied to you, the Company's customer, for use solely and
 exclusively on Microchip PIC Microcontroller products. The
 software is owned by the Company and/or its supplier, and is
 protected under applicable copyright laws. All rights are reserved.
 Any use in violation of the foregoing restrictions may subject the
 user to criminal sanctions under applicable laws, as well as to
 civil liability for the breach of the terms and conditions of this
 license.

 THIS SOFTWARE IS PROVIDED IN AN "AS IS" CONDITION. NO WARRANTIES,
 WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *******************************************************************/

#ifndef SYSTEM_H
#define SYSTEM_H

#include <xc.h>
#include <stdbool.h>
#include <stdint.h>

#include "buttons.h"
#include "leds.h"
#include "Stepper.h"

#include "io_mapping.h"
#include "power.h"

//Microcontroller flash memory erase/write page sizes.
#define DRV_FILEIO_INTERNAL_FLASH_CONFIG_ERASE_BLOCK_SIZE 1024
#define DRV_FILEIO_INTERNAL_FLASH_CONFIG_WRITE_BLOCK_SIZE 64
#define CLOCK_FREQ 48000000
#define GetSystemClock() CLOCK_FREQ
#define _XTAL_FREQ CLOCK_FREQ


#define MAIN_RETURN void

/*** System States **************************************************/
typedef enum
{
    SYSTEM_STATE_DEVICE_INIT,
    SYSTEM_STATE_CFG_LOAD,
    SYSTEM_STATE_USB_START,
    SYSTEM_STATE_USB_SUSPEND,
    SYSTEM_STATE_USB_RESUME
} SYSTEM_STATE;

typedef union 
{
    uint16_t Val;    
    struct 
    {
        uint8_t LB;
        uint8_t HB;
    } byte;    
} UINT16_VAL, UINT16_BITS;

// Application-dependent structure used to contain address information
typedef struct 
{
    
    uint16_t MainGearCogsCount;     
    uint16_t GearRatio;             
    uint16_t SM_StepCount;           
    uint16_t SM_uStepCount;               
    int16_t IntervalCorrection;         // step
    int32_t IntervalCorrection_1kk;     // step/1kk 
    uint16_t PulseWidth;                // in step    
    uint32_t TimerFrequency;            // in Hz
    uint16_t Interval;                  // step
    uint32_t Interval_1kk;              // step/1kk 
    uint32_t StarDayLength;
    uint32_t StarDayLength_1kk;
} APP_CONFIG;
/*********************************************************************
* Function: void SYSTEM_Initialize( SYSTEM_STATE state )
*
* Overview: Initializes the system.
*
* PreCondition: None
*
* Input:  SYSTEM_STATE - the state to initialize the system into
*
* Output: None
*
********************************************************************/
void SYSTEM_Initialize( SYSTEM_STATE state );


/*********************************************************************
* Function: void SYSTEM_Tasks(void)
*
* Overview: Runs system level tasks that keep the system running
*
* PreCondition: System has been initalized with SYSTEM_Initialize()
*
* Input: None
*
* Output: None
*
********************************************************************/
//void SYSTEM_Tasks(void);
#define SYSTEM_Tasks()
void CCP9Init(void);
void LoadCfg(APP_CONFIG * config);
void SaveCfg(APP_CONFIG * config);
#endif //SYSTEM_H
